/*CMD
  command: ru
  help: 
  need_reply: 
  auto_retry_time: 
  folder: 
  answer: 
  keyboard: 
  aliases: 
CMD*/

Libs.Lang.user.setLang("ru");
var video = Bot.getProperty("video1");
Api.sendVideo({
  video: video
});
Bot.sendInlineKeyboard([{ title: "✅Продолжить✅", command: "start"}], "💎 M7 - это кросс-цепная торговая терминальная система для DEX и CEX.\n💻 Работает с криптовалютой на нескольких DEX и CEX в различных сетях с полным набором торговых инструментов. Технический анализ, управление портфелем и автоматизация торговых стратегий — все это доступно в одном месте.\n💵 Получать прибыль очень просто, мы уже все сделали за вас!");

/*
💎 T7 - это кросс-цепная торговая терминальная система для DEX и CEX.
💻 Работает с криптовалютой на нескольких DEX и CEX в различных сетях с полным набором торговых инструментов. Технический анализ, управление портфелем и автоматизация торговых стратегий — все это доступно в одном месте.\n💵 Получать прибыль очень просто, мы уже все сделали за вас!*/
