/*CMD
  command: 💸 Выбор подписки
  help: 
  need_reply: 
  auto_retry_time: 
  folder: 
  answer: 
  keyboard: 
  aliases: 💸 choose subscribe
CMD*/

var lang = Libs.Lang;
Bot.sendKeyboard("💰 Новичок 💰,💎 Продвинутый 💎,\n🥷 VIP чат 🥷,\n❌ Вернуться","💸 Наши услуги включают в себя три пакета: 💸");
var thxt =
    "🥷 VIP чат 🥷 :\n⁃ VIP чат с сигналами для торговли (спот, фьючерсные)\n\n💳 1 месяц - <s>100 USDT</s> <b>75 USDT</b> 💳\n💵 3 месяца - <s>300 USDT</s> <b>150 USDT</b> 💵\n💎 6 месяцев - <s>600 USDT</s> <b>300 USDT</b> 💎"
Api.sendMessage({
 text: thxt,
 parse_mode: "HTML"
})

thxt =
    "💰 Новичок 💰 :\n⁃ Новостной и обучающий чат, регистрация и ознакомление на всевозможных биржах\n⁃ Базовый курс\n⁃ VIP чат с сигналами на торговлю (спот, фьючерсные)\n\n💳 1 месяц - <s>200 USDT</s> <b>100 USDT</b> 💳\n💵 3 месяца - <s>400 USDT</s> <b>200 USDT</b> 💵"
Api.sendMessage({
 text: thxt,
 parse_mode: "HTML"
})

thxt =
    "💎 Продвинутый 💎 :\n⁃ 4 полных курса для изучения криптовалюты (введение, торговля, технический анализ, NFT)\n⁃ VIP чат с сигналами на торговлю (спот, фьючерсные)\n⁃ Новостной и обучающий чат, регистрация и ознакомление на всевозможных биржах\n⁃ Дополнительные возможности для заработка (Launchpad, NFT, ByVotes и т.д.)\n⁃ Поддержка от кураторов\n\n💳 1 месяц - <s>400 USDT</s> <b>200 USDT</b> 💳\n💵 3 месяца - <s>800 USDT</s> <b>400 USDT</b> 💵\n💎 6 месяцев - <s>1200 USDT</s> <b>600 USDT</b> 💎"
Api.sendMessage({
 text: thxt,
 parse_mode: "HTML"
})

Bot.sendMessage("🔥 Скидка действует до конца месяца!")

/*Bot.sendMessage("🥷 VIP чат 🥷 :\n⁃ VIP чат с сигналами для торговли (спот, фьючерсные)\n\n💰 Новичок 💰 :\n⁃ Новостной и обучающий чат, регистрация и ознакомление на всевозможных биржах\n⁃ Фьючерсы\n⁃ VIP чат с сигналами на торговлю (спот, фьючерсные)\n\n💎 Продвинутый 💎 :\n⁃ 4 полных курса для изучения криптовалюты (введение, торговля, технический анализ, NFT)\n⁃ VIP чат с сигналами на торговлю (спот, фьючерсные)\n⁃ Новостной и обучающий чат.\n⁃ Дополнительные возможности для заработка (Launchpad, NFT, ByVotes и т.д.)\n⁃ Поддержка от кураторов.");*/

/*Api.sendPhoto({
    photo: "https://ibb.co/4K4HprR",
    caption: "🔮ПРЕМИУМ ПОЖИЗНЕННЫЙ🔮 800 USDT\n\n✅Открывается 1-2-3-4-5 уровней\n✅Реф. Бонус 50|20|10|5|5|%\n\n-Доступ в чат для общения, обсуждения и помощи от кураторов и участников.\n\n-Доступ в закрытый канал, где основные сигналы, новости и напоминания о всех сигналах и  проектах + их разбор.\n\n- чат с сигналами по трейдингу (фьючерсы) + отдельное базовое обучение по трейдингу.\n\n- доступ к закрытому сайту с 80+ обучающими уроками.\n\n-запись уроков базового и углубленного обучения по крипте.\n\n-помощь 24/7 от 5-ти кураторов сообщества + лично от Никиты Каноника."
})
Api.sendPhoto({
    photo: "https://ibb.co/1K5fsFX",
    caption: "💎ПРЕМИУМ💎 400 USDT\n\n✅Открывается 1-2-3-4-5 уровней\n✅Реф. Бонус 50|20|10|5|5|%\n\n-Доступ в чат для общения, обсуждения и помощи от кураторов и участников.\n\n-Доступ в закрытый канал, где основные сигналы, новости и напоминания о всех сигналах и  проектах + их разбор.\n\n- чат с сигналами по трейдингу (фьючерсы) + отдельное базовое обучение по трейдингу.\n\n- доступ к закрытому сайту с 80+ обучающими уроками.\n\n-запись уроков базового и углубленного обучения по крипте.\n\n-помощь 24/7 от 5-ти кураторов сообщества + лично от Никиты Каноника."
})
Api.sendPhoto({
    photo: "https://ibb.co/TRNjPY4",
    caption: "💰СТАНДАРТНЫЙ💰 200 USDT\n\n✅Открывается 1-2 уровень\n✅Реф. Бонус 40|15|%\n\nНе будет чата с сигналами и обучения по трейдингу.\n\nТак же не будет доступа к закрытому углублённому обучению с 80+ уроками.\n\nБазовое обучение сохраняется.\nЗакрытый канал с сигналами по всем другим направлениям сохраняется."
})
Api.sendPhoto({
    photo: "https://ibb.co/bLyfWN7",
    caption: "⚔️НАЧИНАЮЩИЙ⚔️ 100 USDT\n\n✅Открывается 1 уровень\n✅Реф. Бонус 30%\n\nБудет доступен только чат для новичков.\n\nДоступно:\n-Реф. программа.\n\n-Отдельное обучение по тому, как заработать первые деньги  за счёт продвижения и рекомендации сообщества и бота."
}) */
