/*CMD
  command: 🧑🏻‍💻 Наши услуги
  help: 
  need_reply: 
  auto_retry_time: 
  folder: 
  answer: 
  keyboard: 
  aliases: 🧑🏻‍💻 our services
CMD*/

Bot.sendMessage("💸 Наши услуги включают в себя три пакета:\n\n🥷 VIP чат 🥷 :\n⁃ VIP чат с сигналами для торговли (спот, фьючерсные)\n\n💰 Новичок 💰 :\n⁃ Новостной и обучающий чат, регистрация и ознакомление на всевозможных биржах\n⁃ Базовый курс\n⁃ VIP чат с сигналами на торговлю (спот, фьючерсные)\n\n💎 Продвинутый 💎 :\n⁃ 4 полных курса для изучения криптовалюты (введение, торговля, технический анализ, NFT)\n⁃ VIP чат с сигналами на торговлю (спот, фьючерсные)\n⁃ Новостной и обучающий чат, регистрация и ознакомление на всевозможных биржах\n⁃ Дополнительные возможности для заработка (Launchpad, NFT, ByVotes и т.д.)\n⁃ Поддержка от кураторов");
